facebook_clone-master/app/controllers/profile_controller.rb

  def index
    if(params[:id].present?)
      @users = User.where('id = ' + params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]